qxzzxq/burnscope/firmware/sdkconfig.defaults
# Cheap Yellow Display = ESP32-WROOM-32, 4 MB flash.
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions-4mb.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions-4mb.csv"

# LVGL has plenty of room to grow; bump main task stack.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# LVGL color depth + a larger font for the hello-world label.
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_24=y

# Task Watchdog (FSD NFR-3.2): reboot if any subscribed task ceases to feed.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y

# HTTP server: give URIs some headroom for future routes.
CONFIG_HTTPD_MAX_URI_LEN=128
